/*
 *-----------------------------------------------------
 *    Date: Tue Jul 20 10:15:30 AM CST 2021
 *    Effect:
 *          通过换行控制符实现不同输出方式
 *-----------------------------------------------------
 *
 * */

#include <stdio.h>

int main(void)
{
    printf("Zhou An\n");
    printf("Zhou\nAn\n");
    printf("Zhou");
    printf(" An\n");

    return 0;
}

/*
 *  在gcc (GCC) 11.1.0下的结果为:
 *---------------------------------------------------------
 *  Zhou An
 *  Zhou
 *  An
 *  Zhou An
 *---------------------------------------------------------
 *
 * */
