/*
 *-----------------------------------------------------
 *    Date: Tue Jul 20 10:22:58 AM CST 2021
 *    Effect:
 *          打印姓名和地址
 *-----------------------------------------------------
 *
 * */
#include <stdio.h>

int main(void)
{
    printf("My name is Zhou An.\nI'm live in China.\n");
    return 0;
}


/*
 *  在gcc (GCC) 11.1.0下的结果为:
 *---------------------------------------------------------
 *  My name is Zhou An.
 *  I'm live in China.
 *---------------------------------------------------------
 *
 * */
