/*
 *	日期:	2022年 01月 17日 星期一 12:24:59 CST
 *
 *  功能:	将一个 double 类型的变量设置为 1.0/3.0,一个 float 类型的变量设置为 1.0/3.0。分别显示两次计算的结果各 3 次:一次显示小数点后面 6 位数字;一次显示小数点后面 12 位数字;一次显示小数点后面 16 位数字。程序中要包含 float.h 头文件,并显示 FLT_DIG 和 DBL_DIG 的值。1.0/3.0 的值与这些值一致吗?
 *
 * */

#include <stdio.h>
#include "float.h"

int main(void)
{
    float f = 1.0/3.0f;
    double d = 1.0/3.0;

    printf("%lf, %.12lf, %.16lf\n", d, d, d);
    printf("%f, %.12f, %.16f\n", f, f, f);
    printf("%i\n", FLT_DIG);
    printf("%i\n", DBL_DIG);
    return 0;
}

/*
 *	在 gcc (GCC) 11.1.0下的结果为:
 *------------------------------------------------------
 *  
 *  0.333333, 0.333333333333, 0.3333333333333333
 *  0.333333, 0.333333343267, 0.3333333432674408
 *  6
 *  15
 *
 *------------------------------------------------------
 *
 * */
